---
kind: enumMember
id: F:Autodesk.Revit.DB.ListType.Mixed
enum: Autodesk.Revit.DB.ListType
source: html/7163554f-3446-22eb-afa4-5490d5df29c8.htm
---
# Autodesk.Revit.DB.ListType.Mixed

This value may be returned by FormattedText.GetListType()
 when there are multiple list types in the selected range.